# Решение через list
months_list = [
    ['Январь', 'Зима'],
    ['Февраль', 'Зима'],
    ['Март', 'Весна'],
    ['Апрель', 'Весна'],
    ['Май', 'Весна'],
    ['Июнь', 'Лето'],
    ['Июль', 'Лето'],
    ['Август', 'Лето'],
    ['Сентябрь', 'Осень'],
    ['Октябрь', 'Осень'],
    ['Ноябрь', 'Осень'],
    ['Декабрь', 'Зима']
]
month_num = int(input('Введите месяц в виде целого числа: '))
while month_num <= 0 or month_num > 12:
    month_num = int(input('Нужно ввести число от 1 до 12! Повторите попытку: '))
print(months_list[month_num - 1][1])

# Решение через dict
months_dict = {
    1: 'Зима',
    2: 'Зима',
    3: 'Весна',
    4: 'Весна',
    5: 'Весна',
    6: 'Лето',
    7: 'Лето',
    8: 'Лето',
    9: 'Осень',
    10: 'Осень',
    11: 'Осень',
    12: 'Зима'
}
month_num = int(input('Введите месяц в виде целого числа: '))
while month_num <= 0 or month_num > 12:
    month_num = int(input('Нужно ввести число от 1 до 12! Повторите попытку: '))
print(months_dict[month_num])

# Ещё одно, на всякий случай :)
months_dict = {
    'Зима': [1, 2, 12],
    'Весна': [3, 4, 5],
    'Лето': [6, 7, 8],
    'Осень': [9, 10, 11],
}
month_num = int(input('Введите месяц в виде целого числа: '))
while month_num <= 0 or month_num > 12:
    month_num = int(input('Нужно ввести число от 1 до 12! Повторите попытку: '))
for item in months_dict.items():
    if month_num in item[1]:
        print(item[0])
